{"pages":[{"title":"About openGiraffes Group","text":"An unofficial development organization for KaiOS. (We do not make third-party ROMs) zixing LiarOnce Ding Lcsunm miangou","link":"/en/about.html"},{"title":"Chatroom","text":"QQ Group： 653164493 1064072629 We currently do not have any chatrooms other than QQ.","link":"/en/chat.html"},{"title":"Links","text":"KaiOS Developer: https://developer.kaiostech.com MDN: https://developer.mozilla.org BananaHackers: https://bananahackers.net","link":"/en/links.html"}],"posts":[{"title":"Reprinting Rules","text":"Please read the following before reprinting: All reprints must be marked with the source, and self-made applications must be marked with the author or team and their link Reprinted by our self-made application, we need to show screenshots of the real machine running, and take pictures of the real machine when it is running (watermark is recommended to prevent theft of pictures) Starting from 2021-07-25, the tutorials, resources, and self-made applications provided by us are prohibited from being reposted to Baidu Tieba（e.g. 翻盖手机吧、kaios吧）. From 2021-11-06, reprinting to QQ group(814458036) is prohibited. Reprinting of unauthorized resources is prohibited (see the table below for the scope of reprinting) Accept Reject Our team’s made apps (hosted on GitHub and QQ groups) Our team’s made apps (Only used within the development group) Self-compiled, self-packaged resources KaiOS phone firmware (undisclosed or prohibited by the manufacturer’s request) KaiOS phone firmware (publicly available, such as Nokia 8110 4G) Our original introductory tutorials (such as blogs, videos)","link":"/en/Reprinting-rules/"},{"title":"Manually import Let's Encrypt new root CA for KaiOS devices that have not obtained OTA or have been abandoned for updates","text":"Due to the expiration of Let’s Encrypt SSL’s old root certificate DST Root CA X3 on September 30, 2021, a large number of KaiOS devices are unable to use the service with this certificate deployed (browsing the website will prompt This Connection is Untrusted) This tutorial will show you how to manually import a new root certificate so that the affected websites can be accessed properly. This tutorial defaults to you having the required environment and having Wallace Toolbox installed. Preliminary PreparationWhen viewing the content after this tutorial, please make sure your device supports getting ROOT privileges first, if not, please wait for the OEM to provide an OTA update, this tutorial does not apply to devices that cannot be ROOTed. Use Wallace Toolbox to get temporary ROOT permissions (press 1 on the dialpad), for non-US versions of Nokia 6300 4G and Nokia 8000 4G, see This tutorial to get permanent ROOT permissions (we do not provide any support for this) Input *#*#33284#*#* on keypad(For Nokia), plug the device into your computer and type adb devices in terminal to check if the device is returned. Applicate ScriptVisit our modified toolkit address: https://github.com/openGiraffes/b2g-certificates and download or use git clone to get it. 12git clone https://github.com/openGiraffes/b2g-certificatescd b2g-certificates Windows (Testing)For Windows users, we have modified and ported a Batch script and prepared most of the required environment, just download and unzip it, but we have not included ADB in the toolkit, please install the ADB driver and provide your own Android Platform Tools, install the driver and set the environment variables as described in this tutorial. Once you have the toolkit, double click add-certificates-to-phone.bat, Then enter the path as prompted (for example, /data/b2g/mozilla for Nokia user) to import the certificate to your phone, the phone will reboot after execution and you can try to access websites and applications that use Let’s Encrypt SSL. Since we are only doing a rough port, there may be problems, if you have any, you can give feedback here: https://github.com/openGiraffes/b2g-certificates/issues LinuxFor Linux users, execute the following commands as needed. 12345678910111213# Debian/Ubuntusudo apt install libnss3-tools adb wget# RHEL/CentOS/Fedorasudo dnf install nss-tools wget #adb needs to be installed by yourself# ArchLinuxsudo pacman -S nss android-tools wgetchmod +x ./add-certificates-to-phone.sh./add-certificates-to-phone.sh -d # For Nokia user# Windows Subsystem for Linux (WSL)chmod +x ./add-certificates-to-phone-wsl.sh./add-certificates-to-phone-wsl.sh -d # For Nokia user Note: For users using WSL, please make sure that Android Platform Tools (Windows version) is added to the environment variable Path, as the current version does not allow WSL to access the device","link":"/en/manually-import-new-root-ca/"},{"title":"Nokia 8110 4G EDL package flashing tutorial","text":"Scope of applicationIt can be used to rescue, expand, and restore the original system of Nokia 8110 4G. **Note!!! This tutorial only provides the EDL package for TA-1059, TA-1048 is not applicable until you get the EDL package for this model. ** Preparation Windows 7 (recommended, with driver signature verification turned off). Windows 10 can be tried using the following Batch script (also with driver signature verification turned off) **USB 2.0 interface (required) ** USB 3.0 tested unsuccessful QPST Tool, ADB Engineering Cable (optional) All resources for this tutorial: 12345678天翼云盘：https://cloud.189.cn/t/UnIbum2aimYf (访问码:ozw4)OneDrive:https://1drv.ms/u/s!AhQuwVw05ZG7gYxemzvjKV_1aQmetg?e=6kse2tTo download other versions of the QPST Tool for yourself go to:https://qpsttool.com/ FlashingStep 1: PreparationFirst, you need to install the driver, the driver installation package named Qualcomm USB Driver V1.0.exe, after installation, please reboot your system and press F8 before the system boots, select Disable driver signature enforcement (Windows 7). For Windows 10 please select Settings --&gt; Update and Security --&gt; Restore --&gt; Advanced Startup --&gt; Reboot Now and select Troubleshooting --&gt; Advanced Options --&gt; Startup Settings --&gt; Reboot, then press F7 (i.e. Disable driver signature enforcement). Step 2: Enter EDL modeYou have three ways to enter EDL mode. Turn off the phone completely, preferably take out the battery and discharge it for about 10 seconds and then put it back into the battery, press and hold the up arrow key and down arrow key and then press and hold the on button in the off state, at this time the KaiOS logo of the boot will flash for a while and then black screen, at this time plug the USB cable into the computer, display QHSUSB_DLOAD in Other Devices in the device manager or in Port (COM and LPT ) displays Qualcomm HS-USB QDLoader 9008 (COMx) (The value of COMx is not fixed and is based on QFIL). In the boot state, start USB debugging (enter *#*#33284#*#* on the keypad), plug in the computer after the debug icon is displayed, and enter adb reboot edl. Purchase the microUSB EDL cable, plug it into the computer in the off state and press the button on it, the EDL cable style is as shown. Step 3: Install QPST ToolBefore installing QPST Tool, please install Qualcomm USB Driver V1.0.exe which is Qualcomm USB driver. Once the driver is installed, you can install QPST Tool. Step 4: Flashing deviceAfter installing QPST Tool, find QPST --&gt; QFIL in the start menu to open the QFIL, click Select Port to select Qualcomm HS-USB QDLoader 9008 (COMx), select Flat Build in Select Build Type, after that Unzip the package, select prog_emmc_firehose_8909_ddr.mbn in Select Programmer, then click Load XML ... under Select Flat Build. you will be asked to select two XML files, first select rawprogram0.xml from the package and then select patch0.xml. Finally, click Download to start flashing. It is better not to move any device during the flashing process, the Status will return Waiting for reset done.... and the progress bar does not move for a long time, you can unplug the data cable, key off the battery and then install it back on. If the progress bar is finished soon, please check Status to see if there is Download Fail! information, if there is, please check the driver and cable and interface. We doesn’t recommended to flash under Windows 10, because some computers using USB2.0 interface have compatibility problems. Of course, you can also try the fix-usb3.0.bat script in the cloud disk (need to execute with administrator privileges). It is recommended to flash under Windows 7. Step 5: BootingPress and hold the Up-arrow key and Power key to enter Recovery, select Wipe data/factory reset and press the return key to confirm to restore factory settings, select Wipe cache to clear the cache partition. Finally, select Reboot system now to enter the system.","link":"/en/nokia-8110-4g-edl-flash-tutorial/"}],"tags":[],"categories":[]}