{"pages":[{"title":"About openGiraffes Group","text":"An unofficial development organization for KaiOS. (We do not make third-party ROMs) zixing LiarOnce Ding Lcsunm miangou","link":"/en/about.html"},{"title":"Links","text":"KaiOS Developer: https://developer.kaiostech.com MDN: https://developer.mozilla.org BananaHackers: https://bananahackers.net","link":"/en/links.html"}],"posts":[{"title":"Reprinting Rules","text":"Please read the following before reprinting: All reprints must be marked with the source, and self-made applications must be marked with the author or team and their link Reprinted by our self-made application, we need to show screenshots of the real machine running, and take pictures of the real machine when it is running (watermark is recommended to prevent theft of pictures) Starting from 2021-07-25, the tutorials, resources, and self-made applications provided by us are prohibited from being reposted to Baidu Tieba（e.g. 翻盖手机吧、kaios吧） Reprinting of unauthorized resources is prohibited (see the table below for the scope of reprinting) Accept Reject Our team’s made apps (hosted on GitHub and QQ groups) Our team’s made apps (Only used within the development group) Self-compiled, self-packaged resources KaiOS phone firmware (undisclosed or prohibited by the manufacturer’s request) KaiOS phone firmware (publicly available, such as Nokia 8110 4G) Our original introductory tutorials (such as blogs, videos)","link":"/en/Reprinting-rules/"},{"title":"为未获得 OTA 或已被放弃更新的 KaiOS 设备手动导入 Let's Encrypt 新的根证书","text":"Due to the expiration of Let’s Encrypt SSL’s old root certificate DST Root CA X3 on September 30, 2021, a large number of KaiOS devices are unable to use the service with this certificate deployed (browsing the website will prompt This Connection is Untrusted) This tutorial will show you how to manually import a new root certificate so that the affected websites can be accessed properly. This tutorial defaults to you having the required environment and having Wallace Toolbox installed. Preliminary Preparation**When viewing the content after this tutorial, please make sure your device supports getting ROOT privileges first, if not, please wait for the OEM to provide an OTA update, this tutorial does not apply to devices that cannot be ROOTed. ** Use Wallace Toolbox to get temporary ROOT permissions (press 1 on the dialpad), for non-US versions of Nokia 6300 4G and Nokia 8000 4G, see This tutorial to get permanent ROOT permissions (we do not provide any support for this) Input *#*#33284#*#* on keypad(For Nokia), plug the device into your computer and type adb devices in terminal to check if the device is returned. Applicate ScriptVisit our modified toolkit address: https://github.com/openGiraffes/b2g-certificates and download or use git clone to get it. 12git clone https://github.com/openGiraffes/b2g-certificatescd b2g-certificates Windows (Testing)For Windows users, we have modified and ported a Batch script and prepared most of the required environment, just download and unzip it, but we have not included ADB in the toolkit, please install the ADB driver and provide your own Android Platform Tools, install the driver and set the environment variables as described in this tutorial. Once you have the toolkit, double click add-certificates-to-phone.bat to import the certificate to your phone, the phone will reboot after execution and you can try to access websites and applications that use Let’s Encrypt SSL. Since we are only doing a rough port, there may be problems, if you have any, you can give feedback here: https://github.com/openGiraffes/b2g-certificates/issues LinuxFor Linux users, execute the following commands as needed. 12345678910111213# Debian/Ubuntusudo apt-get install libnss3-tools adb wget# RHEL/CentOS/Fedorasudo dnf install nss-tools wget #adb needs to be installed by yourself# ArchLinuxsudo pacman -S nss android-tools wgetchmod +x ./add-certificates-to-phone.sh./add-certificates-to-phone.sh# Windows Subsystem for Linux (WSL)chmod +x ./add-certificates-to-phone-wsl.sh./add-certificates-to-phone-wsl.sh Note: For users using WSL, please make sure that Android Platform Tools (Windows version) is added to the environment variable Path, as the current version does not allow WSL to access the device","link":"/en/manually-import-new-root-ca/"}],"tags":[],"categories":[]}